//=============================================================================
// メインゲーム処理
// 制作：向出創
//=============================================================================
#include <time.h>
#include "Main.h"
#include "Game.h"
#include "Input.h"
#include "Bg.h"
#include "Transition.h"
#include "Sound.h"

//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int	state;	// tips情報
static bool	stateFlag;

//=============================================================================
// 初期化処理
//=============================================================================
void InitGame()
{
	// 背景
	InitBg();


	state = 0;
	stateFlag = false;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitGame()
{
	// 背景
	UninitBg();
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateGame()
{
	// 背景
	UpdateBg();
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawGame()
{
	// Zバッファ無効
	SetZBuffer(false);
	// 背景
	DrawBg();
	// Zバッファ有効
	SetZBuffer(true);

	// Zバッファ有効
	SetZBuffer(false);
	SetBlendState(BS_ALPHABLEND);
	DrawTransition();
	SetBlendState(BS_NONE);
	// Zバッファ有効
	SetZBuffer(true);
}

int GetState()
{
	return state;
}

void SetState(int no)
{
	state = no;
}